import Container from '@/src/common/Container/Container';
import Crumbreads from '@/src/common/Crumbreads/Crumbreads';
import { H1Title, H2Title } from '@/src/common/Title/Title';
import Link from 'next/link';
import { useRouter } from 'next/router';

import styles from './ServiceAgreement.module.scss';

const PrivacyPolicy = () => {
  const { pathname } = useRouter();

  const arrayPathname = pathname.split('/');
  const idPathname = arrayPathname[arrayPathname.length - 1];

  const styleActive = {
    color: '#202227',
    borderLeft: '4px solid #202227',
    paddingLeft: '26px',
  };

  return (
    <Container>
      <div className={styles.agreement}>
        <main>
          <Crumbreads />

          <H1Title
            className={styles.agreement__title}
            title="Політика конфіденційності"
          />

          <H2Title title="1. Загальні положення" />
          <div className={styles['agreement__block-text']}>
            <p>
              1.1. Ця Політика конфіденційності описує, як компанія, яка
              управляє сайтом proliki.com.ua (далі – «Компанія»), збирає,
              використовує та захищає інформацію, яку надають Користувачі сайту
              proliki.com.ua (далі – «Користувачі»).
            </p>
            <p>
              1.2. Компанія поважає конфіденційність Користувачів та робить все
              можливе, щоб захистити їх особисту інформацію від незаконного
              використання та зловживань.
            </p>
          </div>

          <H2Title title="2. Інформація, яку ми збираємо" />
          <div className={styles['agreement__block-text']}>
            <p>
              2.1. Компанія може збирати особисту інформацію Користувачів, яку
              вони надають під час реєстрації на Сайті або в процесі
              користування послугами Компанії. Ця інформація включає, але не
              обмежується, ім&lsquo;я, прізвище, адресу електронної пошти та
              іншу контактну інформацію.
            </p>
            <p>
              2.2. Компанія може також збирати інформацію про користування
              Користувачів Сайтом та послугами Компанії, включаючи інформацію
              про перегляди сторінок, посилання, на які було натиснуто,
              інформацію про браузер та операційну систему Користувача та іншу
              аналогічну інформацію.
            </p>
          </div>

          <H2Title title="3. Використання зібраної інформації" />
          <div className={styles['agreement__block-text']}>
            <p>
              3.1. Компанія використовує зібрану інформацію для забезпечення
              Користувачам якісної послуги та для поліпшення функціоналу Сайту.
            </p>
            <p>
              3.2. Компанія може використовувати електронну пошту Користувачів
              для повідомлень про оновлення послуг та інших важливих
              повідомлень.
            </p>
            <p>
              3.3. Компанія може використовувати зібрану інформацію для
              створення статистичних звітів та досліджень щодо користування
              Сайтом та послугами Компанії, а також для покращення якості та
              ефективності послуг.
            </p>
          </div>
          <H2Title title="4. Розкриття інформації" />
          <div className={styles['agreement__block-text']}>
            <p>
              4.1. Компанія не передає особисту інформацію Користувачів третім
              особам без їх згоди.
            </p>
            <p>
              4.2. Компанія може передати зібрану інформацію третім особам у
              випадку, коли це вимагається законом або правилами діючого
              законодавства.
            </p>
            <p>
              4.3. Компанія може передати зібрану інформацію третім особам в
              разі, якщо це необхідно для захисту прав та інтересів Компанії, а
              також для захисту прав та інтересів Користувачів.
            </p>
          </div>
          <H2Title title="5. Захист інформації" />
          <div className={styles['agreement__block-text']}>
            <p>
              5.1. Компанія прикладає всі зусилля для захисту особистої
              інформації Користувачів від несанкціонованого доступу, втрати,
              зловживання або пошкодження.
            </p>
            <p>
              5.2. Для забезпечення безпеки Користувачів Компанія використовує
              різні технічні та організаційні заходи, такі як шифрування,
              захищені сервери та інші.
            </p>
          </div>
          <H2Title title="6. Посилання на сторонні сайти" />
          <div className={styles['agreement__block-text']}>
            <p>
              6.1. Сайт Компанії може містити посилання на сторонні сайти, які
              не контролюються Компанією та які можуть мати власну політику
              конфіденційності.
            </p>
            <p>
              6.2. Компанія не несе відповідальності за збір та використання
              інформації, яка збирається сторонніми сайтами, які містять
              посилання на Сайт Компанії.
            </p>
          </div>
          <H2Title title="7. Зміни до Політики конфіденційності" />
          <div className={styles['agreement__block-text']}>
            <p>
              7.1. Компанія залишає за собою право змінювати цю Політику
              конфіденційності в будь-який час без повідомлення Користувачів.
            </p>
            <p>
              7.2. Зміни до Політики конфіденційності набувають чинності з
              моменту їх опублікування на Сайті Компанії.
            </p>
            <p>
              7.3. Користувачі повинні регулярно перевіряти цю Політику
              конфіденційності та ознайомлюватися з її змінами.
            </p>
            <p>
              7.4. Продовження використання Сайту після внесення змін до цієї
              Політики конфіденційності означає згоду Користувача з новою
              версією Політики конфіденційності.
            </p>
          </div>
          <H2Title title="8. Контакти" />
          <div className={styles['agreement__block-text']}>
            <p>
              8.1. У разі виникнення будь-яких питань або пропозицій щодо цієї
              Політики конфіденційності Користувачі можуть звертатися до
              Компанії за адресою, вказаною на Сайті Компанії.
            </p>
            <p>
              8.2. Компанія завжди готова відповісти на запити Користувачів та
              надати додаткову інформацію щодо збору, використання та захисту
              особистої інформації.
            </p>
          </div>
        </main>
        <aside>
          <ul className={styles.agreement__aside}>
            <li style={idPathname === 'agreement' ? styleActive : null}>
              <Link href="/service_page/agreement">Угода користувача</Link>
            </li>
            <li style={idPathname === 'confidentiality' ? styleActive : null}>
              <Link href="/service_page/confidentiality">
                Політика конфіденційності
              </Link>
            </li>
            <li style={idPathname === 'cookie' ? styleActive : null}>
              <Link href="/service_page/cookie">Обробка cookie</Link>
            </li>
          </ul>
        </aside>
      </div>
    </Container>
  );
};

export default PrivacyPolicy;
