import Container from '@/src/common/Container/Container';
import Crumbreads from '@/src/common/Crumbreads/Crumbreads';
import MenuSort from '@/src/common/MenuSort/MenuSort';
import { H1Title, H2Title } from '@/src/common/Title/Title';
import Link from 'next/link';
import { useRouter } from 'next/router';

import styles from './ServiceAgreement.module.scss';

const ServiceAgreement = () => {
  const { pathname } = useRouter();

  const arrayPathname = pathname.split('/');
  const idPathname = arrayPathname[arrayPathname.length - 1];

  const styleActive = {
    color: '#202227',
    borderLeft: '4px solid #202227',
    paddingLeft: '26px',
  };

  return (
    <Container>
      <div className={styles.agreement}>
        <main>
          <Crumbreads />

          <H1Title title="Угода користувача" />
          <div className={styles['agreement__block-text']}>
            <p>
              Викладений нижче текст Угоди користувача (надалі – «Угода»),
              адресований невизначеному колу осіб, відвідувачам веб-сайту
              <a href="https://proliki.com.ua/"> https://proliki.com.ua/</a> в
              мережі Інтернет та визначає порядок користування цим веб-сайтом.
            </p>
            <p>
              Ця Угода є юридично обов’язковим документом, який визначає умови
              використання Сайту та послуг, наданих на Сайті. Рекомендуємо
              уважно ознайомитися з цією Угодою перед початком використання
              Сайту та послуг. Використання Сайту та послуг означає згоду
              Користувача з умовами цієї Угоди. Якщо у вас є запитання щодо умов
              цієї Угоди, будь ласка, зверніться до нас за контактною
              інформацією, наведеною на Сайті.
            </p>
          </div>

          <H2Title title="1. Загальні положення" />
          <div className={styles['agreement__block-text']}>
            <p>
              1.1. Угода користувача (далі - Угода) встановлює умови
              використання сайту proliki.com.ua (далі - Сайт) користувачами
              (далі - Користувачі).
            </p>
            <p>
              1.2. Використовуючи Сайт, Користувач погоджується з умовами цієї
              Угоди, а також з обробкою своїх персональних даних у порядку,
              визначеному Політикою конфіденційності Сайту.
            </p>
          </div>

          <H2Title title="2. Права та обов’язки користувача" />
          <div className={styles['agreement__block-text']}>
            <p>
              2.1. Користувач має право використовувати Сайт виключно з метою,
              передбаченою Угодою та законодавством України.
            </p>
            <p>
              2.2. Користувач не має права використовувати Сайт з будь-якою
              метою, що суперечить законодавству України.
            </p>
            <p>
              2.3. Користувач несе відповідальність за достовірність інформації,
              яку він надає на Сайті, а також за збереження конфіденційності
              свого логіну та паролю.
            </p>
          </div>

          <H2Title title="3. Права та обов’язки компанії" />
          <div className={styles['agreement__block-text']}>
            <p>
              3.1. Компанія зобов’язується забезпечувати роботу Сайту та
              надавати послуги Користувачам відповідно до умов цієї Угоди та
              законодавства України.
            </p>
            <p>
              3.2. Компанія має право заблокувати доступ Користувача до Сайту за
              порушенням умов цієї Угоди або законодавства України.
            </p>
            <p>
              3.3. Компанія має право відмовити у наданні послуг Користувачу,
              який порушує умови цієї Угоди або законодавства України.
            </p>
          </div>

          <H2Title title="4. Посилання на зовнішні ресурси" />
          <div className={styles['agreement__block-text']}>
            <p>
              4.1. Сайт може містити посилання на інші сайти, які не належать
              компанії. Компанія не несе відповідальності за зміст та дії інших
              сайтів.
            </p>
            <p>
              4.2. Користувач погоджується, що використання будь-яких зовнішніх
              ресурсів залежить від нього самого та на його власний ризик.
            </p>
          </div>

          <H2Title title="5. Інтелектуальна власність" />
          <div className={styles['agreement__block-text']}>
            <p>
              5.1. Усі матеріали, розміщені на Сайті, включаючи, але не
              обмежуючись, тексти, зображення, графіку, коди та інші елементи, є
              власністю компанії або її партнерів, якщо інше не зазначено.
            </p>
            <p>
              5.2. Користувач не має права копіювати, редагувати,
              розповсюджувати, продавати чи іншим чином використовувати
              матеріали Сайту без попереднього дозволу компанії.
            </p>
          </div>

          <H2Title title="6. Відповідальність сторін" />
          <div className={styles['agreement__block-text']}>
            <p>
              6.1. Компанія не несе відповідальності за будь-які збитки, які
              можуть виникнути внаслідок використання Користувачем Сайту або
              послуг, наданих на Сайті.
            </p>
            <p>
              6.2. Користувач несе відповідальність за будь-які порушення умов
              цієї Угоди та законодавства України.
            </p>
          </div>

          <H2Title title="7. Закінчення угоди" />
          <div className={styles['agreement__block-text']}>
            <p>
              7.1. Ця Угода набуває чинності з моменту, коли Користувач здійснює
              вхід на Сайт.
            </p>
            <p>
              7.2. Користувач може завершити Угоду в будь-який момент, закривши
              вікно браузера та переступивши за межі Сайту.
            </p>
            <p>
              7.3. Компанія має право припинити цю Угоду у будь-який час, якщо
              Користувач порушує умови цієї Угоди або законодавства України.
            </p>
          </div>

          <H2Title title="8. Загальні положення" />
          <div className={styles['agreement__block-text']}>
            <p>
              8.1. Ця Угода є єдиним договором між Користувачем та компанією
              щодо використання Сайту та замінює будь-які попередні домовленості
              або угоди.
            </p>
            <p>
              8.2. Якщо будь-яке положення цієї Угоди визнано недійсним або
              непридатним до застосування, це не впливає на залишок Угоди.
            </p>
            <p>
              8.3. Користувач не має права передавати свої права або обов’язки
              згідно з цією Угодою третім особам без попереднього письмового
              дозволу компанії.
            </p>
          </div>

          <H2Title title="9. Законодавство та порядок вирішення спорів" />
          <div className={styles['agreement__block-text']}>
            <p>
              9.1. Ця Угода та відносини між Користувачем та компанією
              регулюються законодавством України.
            </p>
            <p>
              9.2. У разі виникнення спорів, пов’язаних з використанням Сайту
              та/або послуг, наданих на Сайті, Сторони зобов’язуються вирішувати
              їх шляхом переговорів. Якщо спір не буде врегульовано шляхом
              переговорів, він передається на розгляд відповідного суду
              відповідно до законодавства України.
            </p>
          </div>

          <H2Title title="10. Контактна інформація" />
          <div className={styles['agreement__block-text']}>
            <p>
              10.1. Якщо у вас виникли запитання щодо цієї Угоди або
              використання Сайту, ви можете зв&lsquo;язатися з нами за допомогою
              контактної інформації, наведеної на Сайті.
            </p>
            <p>
              10.2. Компанія залишає за собою право змінювати контактну
              інформацію без попереднього повідомлення Користувачів.
            </p>
            <p>
              10.3. Користувачі можуть надсилати свої запити компанії на
              електронну пошту, вказану на Сайті.
            </p>
            <p>
              10.4. Компанія зобов&lsquo;язується надати Користувачеві відповідь
              на його запит протягом розумного часу з моменту отримання запиту.
            </p>
          </div>
        </main>
        <aside>
          <ul className={styles.agreement__aside}>
            <li style={idPathname === 'agreement' ? styleActive : null}>
              <Link href="/service_page/agreement">Угода користувача</Link>
            </li>
            <li style={idPathname === 'confidentiality' ? styleActive : null}>
              <Link href="/service_page/confidentiality">
                Політика конфіденційності
              </Link>
            </li>
            <li style={idPathname === 'cookie' ? styleActive : null}>
              <Link href="/service_page/cookie">Обробка cookie</Link>
            </li>
          </ul>

          {/* <div className={styles['menu-sort']}>
            <div
              onClick={() => console.log('Open')}
              className={styles['menu-sort__bg']}
            ></div>
            <div className={styles['menu-sort__list']}>
              <ul>
                <li style={idPathname === 'agreement' && sortCheck}>
                  <Link href="/service_page/agreement">Угода користувача</Link>
                </li>
                <li
                  style={idPathname === 'confidentiality' ? styleActive : null}
                >
                  <Link href="/service_page/confidentiality">
                    Політика конфіденційності
                  </Link>
                </li>
                <li style={idPathname === 'cookie' ? styleActive : null}>
                  <Link href="/service_page/cookie">Обробка cookie</Link>
                </li>
              </ul>
            </div>
          </div> */}
        </aside>
      </div>
    </Container>
  );
};

export default ServiceAgreement;
// <li
//                   key={index}
//                   onClick={() => {
//                     console.log('click');
//                   }}
//                   className={styles['menu-sort__item']}
//                 >
//                   <a href="#">{item}</a>
//                   {drugsSort === item && sortCheck}
//                 </li>
