import Container from '@/src/common/Container/Container';
import { H1Title, H2Title } from '@/src/common/Title/Title';
import Link from 'next/link';
import { useRouter } from 'next/router';

import styles from './ServiceAgreement.module.scss';

const ServiceAgreement = () => {
  const { pathname } = useRouter();

  const arrayPathname = pathname.split('/');
  const idPathname = arrayPathname[arrayPathname.length - 1];

  const styleActive = {
    color: '#202227',
    borderLeft: '4px solid #202227',
    paddingLeft: '26px',
  };

  return (
    <Container>
      <div className={styles.agreement}>
        <main>
          <ul className={styles.agreement__crumbreads}>
            <li>
              <Link href="/">Proliki</Link>
            </li>
          </ul>
          <H1Title title="Угода користувача" />
          <div className={styles['agreement__block-text']}>
            <p>
              Викладений нижче текст Угоди користувача (надалі – «Угода»),
              адресований невизначеному колу осіб, відвідувачам веб-сайту
              <a href="https://proliki.com.ua/"> https://proliki.com.ua/</a> в
              мережі Інтернет та визначає порядок користування цим веб-сайтом,
              власником якого є ........................................ (надалі
              – «Власник»).
            </p>
            <p>
              Ця Угода є публічною офертою відповідно до чинного законодавства
              України. Вчинення конклюдентних дій фізичними особами (далі
              іменовані «Користувач», а в множині «Користувачі»), спрямованих на
              використання веб-сайту{' '}
              <a href="https://proliki.com.ua/"> https://proliki.com.ua/</a>
              вважається безумовним прийняттям (акцептом) цієї Угоди. Користувач
              цим визнає, що акцепт Угоди рівносильний підписанню та укладенню
              Угоди на умовах, викладених в цій Угоді.
            </p>
          </div>

          <H2Title title="1. Терміни та визначення" />
          <div className={styles['agreement__block-text']}>
            <p>
              1.1. «Веб-сайт» (надалі – «Сайт») – інформаційний ресурс в мережі
              Інтернет, який розміщений за адресою{' '}
              <a href="https://proliki.com.ua/"> https://proliki.com.ua/</a> та
              містить текстову, графічну та іншу інформацію, яка сприймається як
              єдине ціле, та підтримується комплексом системних програмних
              засобів.
            </p>
            <p>
              1.2. «Контент» – інформаційне оформлення Сайту, що включає в себе:
              вебінари, фонограми, відеограми, текстові, графічні,
              аудіовізуальні або будь-які інші матеріали.
            </p>
            <p>
              1.3. «Аккаунт» – обліковий запис Користувача створений в момент
              авторизації на Сайті, що дозволяє Власнику ідентифікувати
              (авторизувати) Користувача шляхом використання облікового запису
              Користувача в соціальних мережах Facebook, Twitter або Google.
            </p>
            <p>
              1.4. «Користувач» – будь-яка фізична особа, яка коли-небудь
              здійснювала доступ до Сайту та досягла віку, допустимого для
              акцепту цієї Угоди.
            </p>
            <p>
              1.5. «Сторона» або разом «Сторони» – Користувач та/або Власник.
            </p>
            <p>
              1.6. «Послуги» (сервіси Сайту) – будь-які послуги, які
              пропонуються на Сайті Власника та включають у себе, але не
              обмежуються послугами створення платформ для комунікації з
              бізнесом та нових форматів матеріалів та спецпроектів, створення
              та підвищення якості Контенту для читачів Користувачів, відео
              продакшн, галузеві спецпроекти, пряма реклама тощо.
            </p>
          </div>

          <H2Title title="2. Загальні положення" />
          <div className={styles['agreement__block-text']}>
            <p>
              2.1. Користувач шляхом переходу на Сайт Власника надає свою згоду
              на дотримання всіх умов цієї Угоди, у тому числі, шляхом
              авторизації на Сайті свого облікового запису (Аккаунту). Ця Угода
              є юридично обов&apos;язковою угодою між Користувачем і Власником,
              предметом якої є надання Користувачеві безоплатних послуг з
              використання Сайту та/або його оплачуваних Послуг (оплачуваних
              сервісів Сайту).
            </p>
            <p>
              2.2. Межі використання Сайту Користувачами встановлюються
              Власником на власний розсуд.
            </p>
            <p>
              2.3. Цю Угоду може бути змінено та/або доповнено Власником Сайту в
              односторонньому порядку без будь-якого повідомлення Користувачів.
              Ця Угода є відкритим і загальнодоступним документом.
            </p>
            <p>
              2.4. Користувачі зобов’язані ознайомлюватися зі змістом цієї Угоди
              перед кожним користуванням Сайтом. Якщо Користувач продовжує
              користуватися Сайтом після оприлюднення зміненого та/або
              доповненого змісту цієї Угоди, це означає, що Користувач надає
              згоду на дотримання умов Угоди з усіма її змінами та/або
              доповненнями.
            </p>
            <p>
              2.5. У випадку внесення істотних змін до Угоди Власником буде
              розміщено повідомлення на Сайті та зазначено термін набрання цими
              змінами чинності. Якщо протягом зазначеного терміну Користувач не
              відмовиться від прийняття цих змін в письмовій формі, це
              означатиме, що Користувач погодився з відповідними змінами Угоди.
            </p>
          </div>
        </main>
        <aside>
          <ul className={styles.agreement__aside}>
            <li style={idPathname === 'agreement' ? styleActive : null}>
              <Link href="/service_page/agreement">Угода користувача</Link>
            </li>
            <li style={idPathname === 'confidentiality' ? styleActive : null}>
              <Link href="/service_page/confidentiality">
                Політика конфіденційності
              </Link>
            </li>
            <li style={idPathname === 'cookie' ? styleActive : null}>
              <Link href="/service_page/cookie">Обробка cookie</Link>
            </li>
          </ul>
        </aside>
      </div>
    </Container>
  );
};

export default ServiceAgreement;
