import BtnMore from '@/src/common/BtnMore/BtnMore';
import Container from '@/src/common/Container/Container';
import Title, { TittleIntermidiate } from '@/src/common/Title/Title';
import Image from 'next/image';
import Link from 'next/link';
import { useRouter } from 'next/router';
import { useState } from 'react';
import active_substances from '../../data/active_substances';
import DrugsTable from '../DrugsTable/DrugsTable';
import styles from './ActiveSubstancesPage.module.scss';

const ActiveSubstancesPage = () => {
  const router = useRouter();
  const pathNameId = router?.query?.id;

  const [activeTab, setActiveTab] = useState('');
  console.log(activeTab);

  const activeTabHandler = (e) => {
    setActiveTab(e.target.textContent);
  };

  const activeTabStyle = {
    color: '#4D5156',
    cursor: 'not-allowed',
    background: '#EAF2FA',
  };

  if (!pathNameId) return null;

  const { ua, eng } = Object.values(active_substances)
    .flat(2)
    .find((elem) => elem.eng === pathNameId);

  return (
    <Container>
      <div className={styles['active-substance']}>
        <ul className={styles['active-substance__crumbreads']}>
          <li>
            <Link href="/">Proliki</Link>
          </li>
          <li>
            <svg
              xmlns="http://www.w3.org/2000/svg"
              width="4"
              height="4"
              viewBox="0 0 4 4"
              fill="none"
            >
              <rect width="4" height="4" rx="2" fill="#4D5156" />
            </svg>
          </li>
          <li>
            <Link href="/atx_classification">Aктивні речовини</Link>
          </li>
        </ul>
        <div className={styles['active-substance__title']}>
          <h1>{`  ${ua} (${eng})`}</h1>
        </div>
        <ul className={styles['active-substance__nav']}>
          <li onClick={activeTabHandler}>
            <a
              style={activeTab === 'Препараты' ? activeTabStyle : {}}
              href="#drags"
            >
              Препараты
            </a>
          </li>
          <li onClick={activeTabHandler}>
            <a
              style={activeTab === 'Описание' ? activeTabStyle : {}}
              href="#description"
            >
              Описание
            </a>
          </li>
          <li onClick={activeTabHandler}>
            <a
              style={activeTab === 'Подробно о веществе' ? activeTabStyle : {}}
              href="#about"
            >
              Подробно о веществе
            </a>
          </li>
        </ul>
        <h2 className={styles['active-substance__title-score']} id="drags">
          Лекарственные препараты содержащие активное вещество {ua} (24)
        </h2>
        <DrugsTable />
        <div className={styles['active-substance__btn-more']}>
          <BtnMore />
        </div>
        <div id="description" className={styles['drug-formula']}>
          <div className={styles['drug-formula__image-block']}>
            <div className={styles['drug-formula__img']}>
              <Image
                src={`/img/drugs/formula.jpg`}
                width={360}
                height={360}
                alt="Ібупрофен"
              />
            </div>
            <a className={styles['drug-formula__link']} href="#">
              <svg>
                <path
                  xmlns="http://www.w3.org/2000/svg"
                  fillRule="evenodd"
                  clipRule="evenodd"
                  d="M19.6299 2.18193C18.4281 2.18193 17.4446 3.16383 17.4446 4.36393C17.4446 4.72767 17.5175 5.05491 17.6631 5.34583C18.0274 6.07305 18.7557 6.54586 19.6296 6.54586C20.8314 6.54586 21.8149 5.56395 21.8149 4.36386C21.8149 3.16384 20.8315 2.18187 19.6299 2.18187L19.6299 2.18193ZM15.2594 4.36367C15.2594 1.96355 17.2259 0 19.6296 0C22.0334 0 23.9999 1.96355 23.9999 4.36367C23.9999 6.76378 22.0334 8.72733 19.6296 8.72733C18.3185 8.72733 17.1533 8.14544 16.352 7.23633L8.63121 11.0909C8.70412 11.3818 8.74045 11.7091 8.74045 12C8.74045 12.2909 8.70412 12.6182 8.63121 12.9091L16.352 16.7637C17.1533 15.8546 18.3185 15.2727 19.6296 15.2727C22.0334 15.2727 23.9999 17.2362 23.9999 19.6363C23.9999 22.0365 22.0334 24 19.6296 24C17.2259 24 15.2594 22.0365 15.2594 19.6363C15.2594 19.3091 15.2957 19.0182 15.3686 18.7272L7.64781 14.8727C6.84659 15.7818 5.68131 16.3637 4.37022 16.3637C1.9665 16.3637 0 14.4001 0 12C0 9.59988 1.9665 7.63633 4.37022 7.63633C5.68131 7.63633 6.84659 8.21822 7.64781 9.12734L15.3686 5.27278C15.296 4.98208 15.2594 4.69114 15.2594 4.36367ZM4.33369 9.81833C3.13186 9.81833 2.14842 10.8002 2.14842 12.0003C2.14842 13.2004 3.1318 14.1823 4.33369 14.1823C5.17127 14.1823 5.9362 13.7095 6.30019 12.9823C6.44576 12.6913 6.51867 12.3641 6.51867 12.0004C6.51867 11.6366 6.44576 11.3094 6.30019 11.0185C5.93615 10.2913 5.20782 9.81846 4.33369 9.81846V9.81833ZM19.6297 17.4549C18.7921 17.4549 18.0272 17.9277 17.6632 18.6549C17.5176 18.9458 17.4447 19.273 17.4447 19.6368C17.4447 20.8368 18.4281 21.8188 19.63 21.8188C20.8319 21.8188 21.8153 20.8369 21.8153 19.6368C21.8148 18.4368 20.8314 17.4548 19.6298 17.4548L19.6297 17.4549Z"
                  fill="#0058E9"
                />
              </svg>
            </a>
          </div>

          <div className={styles['drug-formula__info']}>
            <p>CAS №: 745-65-3 C20H34O5</p>
            <p>
              USPDDN:
              (1R,2R,3R)-3-гидрокси-2-((E)-(3S)-3-гидрокси-1-октенил)-5-оксоциклопентангептаноевая
              кислота.
            </p>
            <p>NLM: 11α,15α-дигидрокси-9-оксо-13-транс-простеноевая кислота.</p>
            <p>
              RTECS: (–)-простагландин E1; или
              3-гидрокси-2-(3-гидрокси-1-октенил)-5-оксоциклопентатенгептаноевая
              кислота.
            </p>
            <p>
              Mm = 354,49 Да. Белый или беловатый кристаллический порошок. Точка
              плавления — 110–116 °С;
            </p>
            <p>
              рКа = 4,85; log P (октанол-вода) = 3,2; растворимость в воде —
              26,7 мг/л при температуре 25 °С или 80 мг/л при температуре 35 °С
              в бидистиллированной воде.
            </p>
          </div>
        </div>
        <h2
          id="about"
          className={styles['active-substance__title-description']}
        >
          Подробно про {ua}
        </h2>
        <ul className={styles['active-substance__list-description']}>
          <li>
            <span>•</span>
            <a href="#">Фармакологические свойства</a>
          </li>
          <li>
            <span>•</span>
            <a href="#">Показания</a>
          </li>
          <li>
            <span>•</span>
            <a href="#">Противопоказания</a>
          </li>
          <li>
            <span>•</span>
            <a href="#">Побочные эффекты</a>
          </li>
          <li>
            <span>•</span>
            <a href="#">Условия хранения</a>
          </li>
          <li>
            <span>•</span>
            <a href="#">Противопоказания</a>
          </li>
          <li>
            <span>•</span>
            <a href="#">Противопоказания</a>
          </li>
          <li>
            <span>•</span>
            <a href="#">Противопоказания</a>
          </li>
          <li>
            <span>•</span>
            <a href="#">Передозировка</a>
          </li>
        </ul>
        <h3 className={styles['active-substance__title-block']}>
          Фармакологические свойства
        </h3>
        <div className={styles['active-substance__block-text']}>
          <p>
            Правильное питание и физическая активность – залог здоровья,
            хорошего настроения, заряда бодрости и отличного внешнего вида.
            Сбалансированный рацион, даже если он составлен по всем правилам, в
            соответствии со всеми рекомендациями относительно соотношения
            белки/жиры/углеводы, не способен насытить организм необходимыми
            витаминами, минералами, микроэлементами. В связи с этим, многие, кто
            следит за здоровьем и старается поддерживать его на постоянно
            высоком уровне, предпочитает недорого и быстро купить бады в
            интернет аптеке.
          </p>
          <p>
            Быстро метаболизируется. Основные метаболиты выводятся с мочой (88%)
            и калом (12%).
          </p>
          Показания Алпростадил
        </div>
        <h3 className={styles['active-substance__title-block']}>
          Показания {ua}
        </h3>
        <div className={styles['active-substance__block-text']}>
          <p>
            У взрослых при заболеваниях периферических артерий применяют по
            интермиттирующей многонедельной схеме. Рекомендуемая доза — от 50 до
            200 мкг 1 раз в сутки или от 50 до 100 мкг 2 раза в сутки при более
            тяжелых состояниях. Вводят в/в капельно в течение 2 ч в 100–500 мл
            0,9% р-ра натрия хлорида или 5% р-ра глюкозы. Курс лечения — 14
            дней, при достижении терапевтического эффекта лечение продолжают еще
            7–14 дней, общая продолжительность курса лечения не должна превышать
            4 нед. Если терапевтический эффект в течение 2 нед лечения не
            достигнут, алпростадил отменяют.
          </p>

          <p>
            Новорожденным вводят в/в капельно или через пупочную артерию с
            начальной скоростью 0,01—0,05 мкг/кг/мин; после достижения
            терапевтического эффекта проводят поддерживающее лечение в
            минимальной эффективной дозе (обычно 0,01–0,02 мкг/кг/мин). При
            необходимости начальную дозу можно повысить до 0,1 мкг/кг/мин.
          </p>

          <p>
            Дозу для внутрикавернозного введения подбирают для каждого больного
            индивидуально путем осторожного титрования под наблюдением врача.
            При нарушении эрекции нейрогенного генеза рекомендуемая начальная
            доза составляет 1,25 мкг. При каждом последующем введении дозу
            препарата можно повысить вдвое, но не более чем на 5 мкг, до
            достижения минимальной эффективной дозы, вызывающей достаточную
            эрекцию длительностью не более 60 мин.
          </p>

          <p>
            Дозу для внутрикавернозного введения подбирают для каждого больного
            индивидуально путем осторожного титрования под наблюдением врача.
            При нарушении эрекции нейрогенного генеза рекомендуемая начальная
            доза составляет 1,25 мкг. При каждом последующем введении дозу
            препарата можно повысить вдвое, но не более чем на 5 мкг, до
            достижения минимальной эффективной дозы, вызывающей достаточную
            эрекцию длительностью не более 60 мин.
          </p>

          <p>
            При использовании алпростадила в качестве диагностического средства
            рекомендуют применять однократную дозу, которая вызывает эрекцию.
          </p>
        </div>

        <h3 className={styles['active-substance__title-block']}>
          Применение {ua}
        </h3>
        <div className={styles['active-substance__block-text']}>
          <p>
            У взрослых при заболеваниях периферических артерий применяют по
            интермиттирующей многонедельной схеме. Рекомендуемая доза — от 50 до
            200 мкг 1 раз в сутки или от 50 до 100 мкг 2 раза в сутки при более
            тяжелых состояниях. Вводят в/в капельно в течение 2 ч в 100–500 мл
            0,9% р-ра натрия хлорида или 5% р-ра глюкозы. Курс лечения — 14
            дней, при достижении терапевтического эффекта лечение продолжают еще
            7–14 дней, общая продолжительность курса лечения не должна превышать
            4 нед. Если терапевтический эффект в течение 2 нед лечения не
            достигнут, алпростадил отменяют.
          </p>
          <p>
            Новорожденным вводят в/в капельно или через пупочную артерию с
            начальной скоростью 0,01—0,05 мкг/кг/мин; после достижения
            терапевтического эффекта проводят поддерживающее лечение в
            минимальной эффективной дозе (обычно 0,01–0,02 мкг/кг/мин). При
            необходимости начальную дозу можно повысить до 0,1 мкг/кг/мин.
          </p>
          <p>
            Дозу для внутрикавернозного введения подбирают для каждого больного
            индивидуально путем осторожного титрования под наблюдением врача.
            При нарушении эрекции нейрогенного генеза рекомендуемая начальная
            доза составляет 1,25 мкг. При каждом последующем введении дозу
            препарата можно повысить вдвое, но не более чем на 5 мкг, до
            достижения минимальной эффективной дозы, вызывающей достаточную
            эрекцию длительностью не более 60 мин.
          </p>
          <p>
            При нарушениях эрекции сосудистой, психогенной или смешанной
            этиологии начальная доза составляет 2,5 мкг. При каждом последующем
            введении дозу повышают вдвое, но не более чем на 5–10 мкг до
            достижения минимальной эффективной дозы. Если определенная доза не
            вызывает эффекта, то следующая, более высокая доза, может быть
            введена через 1 ч. При наличии эффекта интервал между введением доз
            должен составлять не менее 1 сут. Как правило, доза не должна
            превышать 60 мкг. Кратность инъекций составляет не более 1 раза в
            сутки и 3 раз в неделю.
          </p>
          <p>
            При использовании алпростадила в качестве диагностического средства
            рекомендуют применять однократную дозу, которая вызывает эрекцию.
          </p>
        </div>

        <h3 className={styles['active-substance__title-block']}>
          Противопоказания
        </h3>
        <div className={styles['active-substance__block-text']}>
          <p>
            Облитерирующие заболевания артерий конечностей — облитерирующий
            эндартериит, перемежающаяся хромота, поражение периферических
            артерий при атеросклерозе, сахарном диабете, болезнь Бюргера,
            синдром Рейно с трофическими нарушениями при васкулите, системной
            склеродермии, воздействии физических факторов (вибрация); врожденные
            дуктусзависимые пороки сердца у новорожденных с показаниями к
            хирургической реконструкции для поддержания временной проходимости
            артериального протока перед корригирующей операцией.
          </p>
          <p>
            Лечение при нарушениях эрекции нейрогенной, сосудистой, психогенной
            или смешанной этиологии; проведение фармакологической пробы в
            комплексе диагностических тестов при нарушениях эрекции.
          </p>
        </div>

        <h3 className={styles['active-substance__title-block']}>
          Побочные эффекты
        </h3>
        <div className={styles['active-substance__block-text']}>
          <p>
            Облитерирующие заболевания артерий конечностей — облитерирующий
            эндартериит, перемежающаяся хромота, поражение периферических
            артерий при атеросклерозе, сахарном диабете, болезнь Бюргера,
            синдром Рейно с трофическими нарушениями при васкулите, системной
            склеродермии, воздействии физических факторов (вибрация); врожденные
            дуктусзависимые пороки сердца у новорожденных с показаниями к
            хирургической реконструкции для поддержания временной проходимости
            артериального протока перед корригирующей операцией.
          </p>
          <p>
            Лечение при нарушениях эрекции нейрогенной, сосудистой, психогенной
            или смешанной этиологии; проведение фармакологической пробы в
            комплексе диагностических тестов при нарушениях эрекции.
          </p>
        </div>

        <h3 className={styles['active-substance__title-block']}>
          Особые указания
        </h3>
        <div className={styles['active-substance__block-text']}>
          <p>
            Облитерирующие заболевания артерий конечностей — облитерирующий
            эндартериит, перемежающаяся хромота, поражение периферических
            артерий при атеросклерозе, сахарном диабете, болезнь Бюргера,
            синдром Рейно с трофическими нарушениями при васкулите, системной
            склеродермии, воздействии физических факторов (вибрация); врожденные
            дуктусзависимые пороки сердца у новорожденных с показаниями к
            хирургической реконструкции для поддержания временной проходимости
            артериального протока перед корригирующей операцией.
          </p>
          <p>
            Лечение при нарушениях эрекции нейрогенной, сосудистой, психогенной
            или смешанной этиологии; проведение фармакологической пробы в
            комплексе диагностических тестов при нарушениях эрекции.
          </p>
        </div>

        <h3 className={styles['active-substance__title-block']}>
          Взаимодействия
        </h3>
        <div className={styles['active-substance__block-text']}>
          <p>
            Облитерирующие заболевания артерий конечностей — облитерирующий
            эндартериит, перемежающаяся хромота, поражение периферических
            артерий при атеросклерозе, сахарном диабете, болезнь Бюргера,
            синдром Рейно с трофическими нарушениями при васкулите, системной
            склеродермии, воздействии физических факторов (вибрация); врожденные
            дуктусзависимые пороки сердца у новорожденных с показаниями к
            хирургической реконструкции для поддержания временной проходимости
            артериального протока перед корригирующей операцией.
          </p>
          <p>
            Лечение при нарушениях эрекции нейрогенной, сосудистой, психогенной
            или смешанной этиологии; проведение фармакологической пробы в
            комплексе диагностических тестов при нарушениях эрекции.
          </p>
        </div>

        <h3 className={styles['active-substance__title-block']}>
          Передозировка
        </h3>
        <div className={styles['active-substance__block-text']}>
          <p>
            Облитерирующие заболевания артерий конечностей — облитерирующий
            эндартериит, перемежающаяся хромота, поражение периферических
            артерий при атеросклерозе, сахарном диабете, болезнь Бюргера,
            синдром Рейно с трофическими нарушениями при васкулите, системной
            склеродермии, воздействии физических факторов (вибрация); врожденные
            дуктусзависимые пороки сердца у новорожденных с показаниями к
            хирургической реконструкции для поддержания временной проходимости
            артериального протока перед корригирующей операцией.
          </p>
          <p>
            Лечение при нарушениях эрекции нейрогенной, сосудистой, психогенной
            или смешанной этиологии; проведение фармакологической пробы в
            комплексе диагностических тестов при нарушениях эрекции.
          </p>
        </div>
      </div>
    </Container>
  );
};

export default ActiveSubstancesPage;
