const atx_classification = [
  {
    id: 1,
    letter: 'A',
    title: 'Препараты, влияющие на пищеварительный тракт и обмен веществ',
    link: '#',
  },
  {
    id: 2,
    letter: 'B',
    title: 'Препараты, влияющие на кроветворение и кровь',
    link: '#',
  },
  {
    id: 3,
    letter: 'C',
    title: 'Препараты для лечения заболеваний сердечно-сосудистой системы',
    link: '#',
  },
  {
    id: 4,
    letter: 'D',
    title: 'Препараты для лечения заболеваний кожи',
    link: '#',
  },

  {
    id: 5,
    letter: 'G',
    title:
      'Препараты для лечения заболеваний мочеполовой системы и половые гормоны',
    link: '#',
  },
  {
    id: 6,
    letter: 'H',
    title: 'Гормональные препараты для системного использования (исключая',
    link: '#',
  },
  {
    id: 7,
    letter: 'J',
    title: 'Противомикробные препараты для системного использования',
    link: '#',
  },
  {
    id: 8,
    letter: 'L',
    title: 'Противоопухолевые препараты и иммуномодуляторы',
    link: '#',
  },
  {
    id: 9,
    letter: 'M',
    title: 'Препараты для лечения заболеваний костно-мышечной системы',
    link: '#',
  },
  {
    id: 10,
    letter: 'N',
    title: 'Препараты для лечения заболеваний нервной системы',
    link: '#',
  },
  {
    id: 11,
    letter: 'P',
    title: 'Противопаразитарные препараты, инсектициды и репелленты',
    link: '#',
  },
  {
    id: 12,
    letter: 'Q',
    title: 'Ветеринарные препараты',
    link: '#',
  },
  {
    id: 13,
    letter: 'R',
    title: 'Препараты для лечения заболеваний респираторной системы',
    link: '#',
  },
  {
    id: 14,
    letter: 'S',
    title: 'Средства, действующие на органы чувств',
    link: '#',
  },
  {
    id: 15,
    letter: 'V',
    title: 'Различные средства',
    link: '#',
  },
];

export default atx_classification;
