const atx_classification = [
  {
    id: 1,
    letter: 'A',
    title: 'Препараты, влияющие на пищеварительный тракт и обмен веществ',
    group: [
      {
        id: 1,
        letter: 'A01',
        title: 'Стоматологические препараты',
        group: [
          {
            id: 1,
            letter: 'A03',
            title:
              'Препараты для лечения нарушенной функции желудочно-кишечного тракта',
          },
          {
            id: 2,
            letter: 'A04',
            title: 'Противорвотные препараты',
          },

          {
            id: 3,
            letter: 'A06',
            title:
              'Препараты для лечения заболеваний печени и желчевыводящих путей',
          },
          {
            id: 4,
            letter: 'A07',
            title: 'Слабительные средства',
          },
        ],
      },
      {
        id: 2,
        letter: 'A02',
        title:
          'Препараты для лечения заболеваний связанных с нарушением кислотности',
      },
      {
        id: 3,
        letter: 'A03',
        title:
          'Препараты для лечения нарушенной функции желудочно-кишечного тракта',
      },
      {
        id: 4,
        letter: 'A04',
        title: 'Противорвотные препараты',
      },

      {
        id: 5,
        letter: 'A06',
        title:
          'Препараты для лечения заболеваний печени и желчевыводящих путей',
      },
      {
        id: 6,
        letter: 'A07',
        title: 'Слабительные средства',
      },
      {
        id: 7,
        letter: 'A09',
        title: 'Противодиарейные препараты',
      },
      {
        id: 8,
        letter: 'A10',
        title:
          'Препараты для лечения избыточного веса (кроме диетических продуктов)',
      },
      {
        id: 9,
        letter: 'A11',
        title: 'Препараты улучшающие пищеварение',
      },
      {
        id: 10,
        letter: 'A12',
        title: 'Противопаразитарные препараты, инсектициды и репелленты',
      },
      {
        id: 11,
        letter: 'A13',
        title: 'Минеральные добавки',
      },
      {
        id: 12,
        letter: 'A14',
        title: 'Общетонизирующие препараты',
      },
      {
        id: 13,
        letter: 'A15',
        title: 'Анаболические препараты',
      },
      {
        id: 14,
        letter: 'A16',
        title: 'Средства повышающие аппетит',
      },
      {
        id: 15,
        letter: 'A17',
        title:
          'Прочие препараты для лечения заболеваний пищеварительной системы и обмена веществ',
      },
    ],
  },
  {
    id: 2,
    letter: 'B',
    title: 'Препараты, влияющие на кроветворение и кровь',
    group: [
      {
        id: 1,
        letter: 'B01',
        title: 'Препарати для лікування захворювань шкіри',
      },
      {
        id: 2,
        letter: 'B02',
        title: 'Препарати для лікування геморою та анальних тріщин',
      },
      {
        id: 3,
        letter: 'B03',
        title: 'Препарати для лікування анемії',
      },
      {
        id: 4,
        letter: 'B05',
        title: 'Розчинники та інфузійні розчини',
      },
      {
        id: 5,
        letter: 'B06',
        title: 'Вітаміни та мікроелементи',
      },
      {
        id: 6,
        letter: 'B07',
        title: 'Препарати для лікування ран та опіків',
      },
      {
        id: 7,
        letter: 'B08',
        title: 'Антисептики та дезінфікуючі засоби',
      },
      {
        id: 8,
        letter: 'B09',
        title: 'Імуномодулятори',
      },
      {
        id: 9,
        letter: 'B12',
        title: 'Препарати з вітаміном В12',
      },
      {
        id: 10,
        letter: 'B13',
        title: 'Інші вітаміни та мікроелементи',
      },
    ],
  },
  {
    id: 3,
    letter: 'C',
    title: 'Препараты для лечения заболеваний сердечно-сосудистой системы',
    group: [
      {
        id: 1,
        letter: 'C01',
        title: 'Кардиотоніки',
      },
      {
        id: 2,
        letter: 'C02',
        title: 'Антигіпертензивні засоби',
      },
      {
        id: 3,
        letter: 'C03',
        title: 'Діуретики',
      },
      {
        id: 4,
        letter: 'C04',
        title: 'Периферичні вазодилататори',
      },
      {
        id: 5,
        letter: 'C05',
        title: 'Вазопротектори',
      },
      {
        id: 6,
        letter: 'C06',
        title: 'Препарати для лікування варикозної хвороби',
      },
      {
        id: 7,
        letter: 'C07',
        title: 'Бета-адреноблокатори',
      },
      {
        id: 8,
        letter: 'C08',
        title: 'Кальцій-антагоністи',
      },
      {
        id: 9,
        letter: 'C09',
        title: 'Інгібітори АПФ',
      },
      {
        id: 10,
        letter: 'C10',
        title: 'Ліпідознижувальні засоби',
      },
      {
        id: 11,
        letter: 'C11',
        title: 'Засоби для лікування гіпертригліцеридемії',
      },
      {
        id: 12,
        letter: 'C12',
        title: 'Препарати для лікування гіпохолестеринемії',
      },
      {
        id: 13,
        letter: 'C13',
        title: 'Препарати для лікування серцевої недостатності',
      },
      {
        id: 14,
        letter: 'C14',
        title: 'Секретолітики травного тракту',
      },
      {
        id: 15,
        letter: 'C15',
        title: 'Серцеві глікозиди',
      },
      {
        id: 16,
        letter: 'C16',
        title: 'Препарати для лікування гіперурикемії та гіперурікозурії',
      },
      {
        id: 17,
        letter: 'C17',
        title: 'Стероїдні гормони для системного застосування',
      },
      {
        id: 18,
        letter: 'C18',
        title: 'Ліки для лікування ожиріння',
      },
      {
        id: 19,
        letter: 'C19',
        title: 'Ліки для лікування злоякісних новоутворень',
      },
      {
        id: 20,
        letter: 'C20',
        title: 'Ліки для лікування раку',
      },
      {
        id: 21,
        letter: 'C21',
        title: 'Ліки для лікування раку шлунка',
      },
      {
        id: 22,
        letter: 'C22',
        title: 'Ліки для лікування раку кишечника',
      },
      {
        id: 23,
        letter: 'C23',

        title: 'Ліки для лікування раку молочної залози',
      },
      {
        id: 24,
        letter: 'C24',
        title: 'Ліки для лікування раку шийки матки',
      },
      {
        id: 25,
        letter: 'C25',
        title: 'Ліки для лікування раку матки',
      },
      {
        id: 26,
        letter: 'C26',
        title: 'Ліки для лікування раку кишківника',
      },
      {
        id: 27,
        letter: 'C27',
        title: 'Ліки для лікування раку нирок',
      },
      {
        id: 28,
        letter: 'C28',
        title: 'Ліки для лікування раку печінки',
      },
      {
        id: 29,
        letter: 'C29',
        title: 'Ліки для лікування раку легень',
      },
      {
        id: 30,
        letter: 'C30',
        title: 'Ліки для лікування раку кості',
      },
      {
        id: 31,
        letter: 'C31',
        title: 'Ліки для лікування раку слизової оболонки рота',
      },
      {
        id: 32,
        letter: 'C32',
        title: 'Ліки для лікування раку слизової оболонки горла',
      },
      {
        id: 33,
        letter: 'C33',
        title: 'Ліки для лікування раку слизової оболонки носа',
      },
      {
        id: 34,
        letter: 'C34',
        title: 'Ліки для лікування раку слизової оболонки шлунка',
      },
      {
        id: 35,
        letter: 'C35',
        title: 'Ліки для лікування раку слизової оболонки кишечника',
      },
      {
        id: 36,
        letter: 'C36',
        title: 'Ліки для лікування раку слизової оболонки кишківника',
      },
      {
        id: 37,
        letter: 'C37',

        title: 'Ліки для лікування раку слизової оболонки шийки матки',
      },
      {
        id: 38,
        letter: 'C38',
        title: 'Ліки для лікування раку слизової оболонки матки',
      },
      {
        id: 39,
        letter: 'C39',
        title: 'Ліки для лікування раку слизової оболонки прямої кишки',
      },
      {
        id: 40,
        letter: 'C40',
        title: 'Ліки для лікування раку слизової оболонки шийки матки',
      },
    ],
  },
  {
    id: 4,
    letter: 'D',
    title: 'Препараты для лечения заболеваний кожи',
    group: [
      {
        id: 1,
        letter: 'D01',
        title: 'Препараты для лечения заболеваний кожи',
      },
      {
        id: 2,
        letter: 'D02',
        title: 'Препараты для лечения заболеваний кожи и подкожной клетчатки',
      },
      {
        id: 3,
        letter: 'D03',
        title:
          'Препараты для лечения заболеваний кожи и подкожной клетчатки при применении наружно',
      },
      {
        id: 4,
        letter: 'D04',
        title: 'Препараты для лечения заболеваний кожи при применении внутри',
      },
      {
        id: 5,
        letter: 'D05',
        title:
          'Препараты для лечения заболеваний кожи при применении наружно и внутри',
      },
      {
        id: 6,
        letter: 'D06',
        title:
          'Препараты для лечения заболеваний кожи и подкожной клетчатки при применении наружно',
      },
      {
        id: 7,
        letter: 'D07',
        title: 'Препараты для лечения заболеваний кожи при применении наружно',
      },
      {
        id: 8,
        letter: 'D08',
        title: 'Препараты для лечения заболеваний кожи при применении наружно',
      },
      {
        id: 9,
        letter: 'D09',
        title: 'Препараты для лечения заболеваний кожи при применении наружно',
      },
      {
        id: 10,
        letter: 'D10',
        title: 'Препараты для лечения заболеваний кожи при применении наружно',
      },
      {
        id: 11,
        letter: 'D11',
        title: 'Препараты для лечения заболеваний волос и кожи головы',
      },
      {
        id: 12,
        letter: 'D12',
        title: 'Препараты для лечения заболеваний кожи при применении наружно',
      },
      {
        id: 13,
        letter: 'D13',
        title: 'Препараты для лечения заболеваний ногтей',
      },
      {
        id: 14,
        letter: 'D14',
        title: 'Препараты для лечения заболеваний кожи при применении наружно',
      },
      {
        id: 15,
        letter: 'D15',
        title: 'Препараты для лечения заболеваний кожи при применении наружно',
      },
    ],
  },

  {
    id: 5,
    letter: 'G',
    title:
      'Препараты для лечения заболеваний мочеполовой системы и половые гормоны',
    group: [
      {
        id: 1,
        letter: 'G01',
        title: 'Препараты для лечения заболеваний полости рта и десен',
      },
      {
        id: 2,
        letter: 'G02',
        title: 'Препараты для лечения заболеваний молочных желез',
      },
      {
        id: 3,
        letter: 'G03',
        title: 'Препараты для лечения заболеваний мочеполовой системы',
      },
      {
        id: 4,
        letter: 'G04',
        title:
          'Препараты для лечения простатита и аденомы предстательной железы',
      },

      {
        id: 5,
        letter: 'G05',
        title: 'Препараты для лечения нарушений гормональной системы у женщин',
      },
      {
        id: 6,
        letter: 'G06',
        title: 'Препараты для лечения нарушений гормональной системы у мужчин',
      },
      {
        id: 7,
        letter: 'G07',
        title: 'Противозачаточные препараты',
      },
      {
        id: 8,
        letter: 'G08',
        title: 'Препараты для лечения бесплодия',
      },
      {
        id: 9,
        letter: 'G09',
        title: 'Препараты для лечения заболеваний гинекологической области',
      },
      {
        id: 10,
        letter: 'G10',
        title: 'Препараты для лечения заболеваний молочных желез у женщин',
      },
      {
        id: 11,
        letter: 'G11',
        title:
          'Препараты для лечения заболеваний мужской репродуктивной системы',
      },
      {
        id: 12,
        letter: 'G12',
        title:
          'Препараты для лечения нарушений функций половой системы у мужчин',
      },
      {
        id: 13,
        letter: 'G13',
        title: 'Средства для контрацепции и планирования семьи',
      },
      {
        id: 14,
        letter: 'G14',
        title: 'Прочие гинекологические препараты',
      },
    ],
  },
  {
    id: 6,
    letter: 'H',
    title: 'Гормональные препараты для системного использования (исключая',
    group: [
      {
        id: 1,
        letter: 'G01',
        title: 'Препараты для лечения заболеваний полости рта и десен',
      },
      {
        id: 2,
        letter: 'G02',
        title: 'Препараты для лечения заболеваний молочных желез',
      },
      {
        id: 3,
        letter: 'G03',
        title: 'Препараты для лечения заболеваний мочеполовой системы',
      },
      {
        id: 4,
        letter: 'G04',
        title:
          'Препараты для лечения простатита и аденомы предстательной железы',
      },

      {
        id: 5,
        letter: 'G05',
        title: 'Препараты для лечения нарушений гормональной системы у женщин',
      },
      {
        id: 6,
        letter: 'G06',
        title: 'Препараты для лечения нарушений гормональной системы у мужчин',
      },
      {
        id: 7,
        letter: 'G07',
        title: 'Противозачаточные препараты',
      },
      {
        id: 8,
        letter: 'G08',
        title: 'Препараты для лечения бесплодия',
      },
      {
        id: 9,
        letter: 'G09',
        title: 'Препараты для лечения заболеваний гинекологической области',
      },
      {
        id: 10,
        letter: 'G10',
        title: 'Препараты для лечения заболеваний молочных желез у женщин',
      },
      {
        id: 11,
        letter: 'G11',
        title:
          'Препараты для лечения заболеваний мужской репродуктивной системы',
      },
      {
        id: 12,
        letter: 'G12',
        title:
          'Препараты для лечения нарушений функций половой системы у мужчин',
      },
      {
        id: 13,
        letter: 'G13',
        title: 'Средства для контрацепции и планирования семьи',
      },
      {
        id: 14,
        letter: 'G14',
        title: 'Прочие гинекологические препараты',
      },
    ],
  },
  {
    id: 7,
    letter: 'J',
    title: 'Противомикробные препараты для системного использования',

    group: [
      {
        id: 1,
        letter: 'G01',
        title: 'Препараты для лечения заболеваний полости рта и десен',
      },
      {
        id: 2,
        letter: 'G02',
        title: 'Препараты для лечения заболеваний молочных желез',
      },
      {
        id: 3,
        letter: 'G03',
        title: 'Препараты для лечения заболеваний мочеполовой системы',
      },
      {
        id: 4,
        letter: 'G04',
        title:
          'Препараты для лечения простатита и аденомы предстательной железы',
      },

      {
        id: 5,
        letter: 'G05',
        title: 'Препараты для лечения нарушений гормональной системы у женщин',
      },
      {
        id: 6,
        letter: 'G06',
        title: 'Препараты для лечения нарушений гормональной системы у мужчин',
      },
      {
        id: 7,
        letter: 'G07',
        title: 'Противозачаточные препараты',
      },
      {
        id: 8,
        letter: 'G08',
        title: 'Препараты для лечения бесплодия',
      },
      {
        id: 9,
        letter: 'G09',
        title: 'Препараты для лечения заболеваний гинекологической области',
      },
      {
        id: 10,
        letter: 'G10',
        title: 'Препараты для лечения заболеваний молочных желез у женщин',
      },
      {
        id: 11,
        letter: 'G11',
        title:
          'Препараты для лечения заболеваний мужской репродуктивной системы',
      },
      {
        id: 12,
        letter: 'G12',
        title:
          'Препараты для лечения нарушений функций половой системы у мужчин',
      },
      {
        id: 13,
        letter: 'G13',
        title: 'Средства для контрацепции и планирования семьи',
      },
      {
        id: 14,
        letter: 'G14',
        title: 'Прочие гинекологические препараты',
      },
    ],
  },
  {
    id: 8,
    letter: 'L',
    title: 'Противоопухолевые препараты и иммуномодуляторы',

    group: [
      {
        id: 1,
        letter: 'G01',
        title: 'Препараты для лечения заболеваний полости рта и десен',
      },
      {
        id: 2,
        letter: 'G02',
        title: 'Препараты для лечения заболеваний молочных желез',
      },
      {
        id: 3,
        letter: 'G03',
        title: 'Препараты для лечения заболеваний мочеполовой системы',
      },
      {
        id: 4,
        letter: 'G04',
        title:
          'Препараты для лечения простатита и аденомы предстательной железы',
      },

      {
        id: 5,
        letter: 'G05',
        title: 'Препараты для лечения нарушений гормональной системы у женщин',
      },
      {
        id: 6,
        letter: 'G06',
        title: 'Препараты для лечения нарушений гормональной системы у мужчин',
      },
      {
        id: 7,
        letter: 'G07',
        title: 'Противозачаточные препараты',
      },
      {
        id: 8,
        letter: 'G08',
        title: 'Препараты для лечения бесплодия',
      },
      {
        id: 9,
        letter: 'G09',
        title: 'Препараты для лечения заболеваний гинекологической области',
      },
      {
        id: 10,
        letter: 'G10',
        title: 'Препараты для лечения заболеваний молочных желез у женщин',
      },
      {
        id: 11,
        letter: 'G11',
        title:
          'Препараты для лечения заболеваний мужской репродуктивной системы',
      },
      {
        id: 12,
        letter: 'G12',
        title:
          'Препараты для лечения нарушений функций половой системы у мужчин',
      },
      {
        id: 13,
        letter: 'G13',
        title: 'Средства для контрацепции и планирования семьи',
      },
      {
        id: 14,
        letter: 'G14',
        title: 'Прочие гинекологические препараты',
      },
    ],
  },
  {
    id: 9,
    letter: 'M',
    title: 'Препараты для лечения заболеваний костно-мышечной системы',

    group: [
      {
        id: 1,
        letter: 'G01',
        title: 'Препараты для лечения заболеваний полости рта и десен',
      },
      {
        id: 2,
        letter: 'G02',
        title: 'Препараты для лечения заболеваний молочных желез',
      },
      {
        id: 3,
        letter: 'G03',
        title: 'Препараты для лечения заболеваний мочеполовой системы',
      },
      {
        id: 4,
        letter: 'G04',
        title:
          'Препараты для лечения простатита и аденомы предстательной железы',
      },

      {
        id: 5,
        letter: 'G05',
        title: 'Препараты для лечения нарушений гормональной системы у женщин',
      },
      {
        id: 6,
        letter: 'G06',
        title: 'Препараты для лечения нарушений гормональной системы у мужчин',
      },
      {
        id: 7,
        letter: 'G07',
        title: 'Противозачаточные препараты',
      },
      {
        id: 8,
        letter: 'G08',
        title: 'Препараты для лечения бесплодия',
      },
      {
        id: 9,
        letter: 'G09',
        title: 'Препараты для лечения заболеваний гинекологической области',
      },
      {
        id: 10,
        letter: 'G10',
        title: 'Препараты для лечения заболеваний молочных желез у женщин',
      },
      {
        id: 11,
        letter: 'G11',
        title:
          'Препараты для лечения заболеваний мужской репродуктивной системы',
      },
      {
        id: 12,
        letter: 'G12',
        title:
          'Препараты для лечения нарушений функций половой системы у мужчин',
      },
      {
        id: 13,
        letter: 'G13',
        title: 'Средства для контрацепции и планирования семьи',
      },
      {
        id: 14,
        letter: 'G14',
        title: 'Прочие гинекологические препараты',
      },
    ],
  },
  {
    id: 10,
    letter: 'N',
    title: 'Препараты для лечения заболеваний нервной системы',

    group: [
      {
        id: 1,
        letter: 'G01',
        title: 'Препараты для лечения заболеваний полости рта и десен',
      },
      {
        id: 2,
        letter: 'G02',
        title: 'Препараты для лечения заболеваний молочных желез',
      },
      {
        id: 3,
        letter: 'G03',
        title: 'Препараты для лечения заболеваний мочеполовой системы',
      },
      {
        id: 4,
        letter: 'G04',
        title:
          'Препараты для лечения простатита и аденомы предстательной железы',
      },

      {
        id: 5,
        letter: 'G05',
        title: 'Препараты для лечения нарушений гормональной системы у женщин',
      },
      {
        id: 6,
        letter: 'G06',
        title: 'Препараты для лечения нарушений гормональной системы у мужчин',
      },
      {
        id: 7,
        letter: 'G07',
        title: 'Противозачаточные препараты',
      },
      {
        id: 8,
        letter: 'G08',
        title: 'Препараты для лечения бесплодия',
      },
      {
        id: 9,
        letter: 'G09',
        title: 'Препараты для лечения заболеваний гинекологической области',
      },
      {
        id: 10,
        letter: 'G10',
        title: 'Препараты для лечения заболеваний молочных желез у женщин',
      },
      {
        id: 11,
        letter: 'G11',
        title:
          'Препараты для лечения заболеваний мужской репродуктивной системы',
      },
      {
        id: 12,
        letter: 'G12',
        title:
          'Препараты для лечения нарушений функций половой системы у мужчин',
      },
      {
        id: 13,
        letter: 'G13',
        title: 'Средства для контрацепции и планирования семьи',
      },
      {
        id: 14,
        letter: 'G14',
        title: 'Прочие гинекологические препараты',
      },
    ],
  },
  {
    id: 11,
    letter: 'P',
    title: 'Противопаразитарные препараты, инсектициды и репелленты',

    group: [
      {
        id: 1,
        letter: 'G01',
        title: 'Препараты для лечения заболеваний полости рта и десен',
      },
      {
        id: 2,
        letter: 'G02',
        title: 'Препараты для лечения заболеваний молочных желез',
      },
      {
        id: 3,
        letter: 'G03',
        title: 'Препараты для лечения заболеваний мочеполовой системы',
      },
      {
        id: 4,
        letter: 'G04',
        title:
          'Препараты для лечения простатита и аденомы предстательной железы',
      },

      {
        id: 5,
        letter: 'G05',
        title: 'Препараты для лечения нарушений гормональной системы у женщин',
      },
      {
        id: 6,
        letter: 'G06',
        title: 'Препараты для лечения нарушений гормональной системы у мужчин',
      },
      {
        id: 7,
        letter: 'G07',
        title: 'Противозачаточные препараты',
      },
      {
        id: 8,
        letter: 'G08',
        title: 'Препараты для лечения бесплодия',
      },
      {
        id: 9,
        letter: 'G09',
        title: 'Препараты для лечения заболеваний гинекологической области',
      },
      {
        id: 10,
        letter: 'G10',
        title: 'Препараты для лечения заболеваний молочных желез у женщин',
      },
      {
        id: 11,
        letter: 'G11',
        title:
          'Препараты для лечения заболеваний мужской репродуктивной системы',
      },
      {
        id: 12,
        letter: 'G12',
        title:
          'Препараты для лечения нарушений функций половой системы у мужчин',
      },
      {
        id: 13,
        letter: 'G13',
        title: 'Средства для контрацепции и планирования семьи',
      },
      {
        id: 14,
        letter: 'G14',
        title: 'Прочие гинекологические препараты',
      },
    ],
  },
  {
    id: 12,
    letter: 'Q',
    title: 'Ветеринарные препараты',

    group: [
      {
        id: 1,
        letter: 'G01',
        title: 'Препараты для лечения заболеваний полости рта и десен',
      },
      {
        id: 2,
        letter: 'G02',
        title: 'Препараты для лечения заболеваний молочных желез',
      },
      {
        id: 3,
        letter: 'G03',
        title: 'Препараты для лечения заболеваний мочеполовой системы',
      },
      {
        id: 4,
        letter: 'G04',
        title:
          'Препараты для лечения простатита и аденомы предстательной железы',
      },

      {
        id: 5,
        letter: 'G05',
        title: 'Препараты для лечения нарушений гормональной системы у женщин',
      },
      {
        id: 6,
        letter: 'G06',
        title: 'Препараты для лечения нарушений гормональной системы у мужчин',
      },
      {
        id: 7,
        letter: 'G07',
        title: 'Противозачаточные препараты',
      },
      {
        id: 8,
        letter: 'G08',
        title: 'Препараты для лечения бесплодия',
      },
      {
        id: 9,
        letter: 'G09',
        title: 'Препараты для лечения заболеваний гинекологической области',
      },
      {
        id: 10,
        letter: 'G10',
        title: 'Препараты для лечения заболеваний молочных желез у женщин',
      },
      {
        id: 11,
        letter: 'G11',
        title:
          'Препараты для лечения заболеваний мужской репродуктивной системы',
      },
      {
        id: 12,
        letter: 'G12',
        title:
          'Препараты для лечения нарушений функций половой системы у мужчин',
      },
      {
        id: 13,
        letter: 'G13',
        title: 'Средства для контрацепции и планирования семьи',
      },
      {
        id: 14,
        letter: 'G14',
        title: 'Прочие гинекологические препараты',
      },
    ],
  },
  {
    id: 13,
    letter: 'R',
    title: 'Препараты для лечения заболеваний респираторной системы',

    group: [
      {
        id: 1,
        letter: 'G01',
        title: 'Препараты для лечения заболеваний полости рта и десен',
      },
      {
        id: 2,
        letter: 'G02',
        title: 'Препараты для лечения заболеваний молочных желез',
      },
      {
        id: 3,
        letter: 'G03',
        title: 'Препараты для лечения заболеваний мочеполовой системы',
      },
      {
        id: 4,
        letter: 'G04',
        title:
          'Препараты для лечения простатита и аденомы предстательной железы',
      },

      {
        id: 5,
        letter: 'G05',
        title: 'Препараты для лечения нарушений гормональной системы у женщин',
      },
      {
        id: 6,
        letter: 'G06',
        title: 'Препараты для лечения нарушений гормональной системы у мужчин',
      },
      {
        id: 7,
        letter: 'G07',
        title: 'Противозачаточные препараты',
      },
      {
        id: 8,
        letter: 'G08',
        title: 'Препараты для лечения бесплодия',
      },
      {
        id: 9,
        letter: 'G09',
        title: 'Препараты для лечения заболеваний гинекологической области',
      },
      {
        id: 10,
        letter: 'G10',
        title: 'Препараты для лечения заболеваний молочных желез у женщин',
      },
      {
        id: 11,
        letter: 'G11',
        title:
          'Препараты для лечения заболеваний мужской репродуктивной системы',
      },
      {
        id: 12,
        letter: 'G12',
        title:
          'Препараты для лечения нарушений функций половой системы у мужчин',
      },
      {
        id: 13,
        letter: 'G13',
        title: 'Средства для контрацепции и планирования семьи',
      },
      {
        id: 14,
        letter: 'G14',
        title: 'Прочие гинекологические препараты',
      },
    ],
  },
  {
    id: 14,
    letter: 'S',
    title: 'Средства, действующие на органы чувств',

    group: [
      {
        id: 1,
        letter: 'G01',
        title: 'Препараты для лечения заболеваний полости рта и десен',
      },
      {
        id: 2,
        letter: 'G02',
        title: 'Препараты для лечения заболеваний молочных желез',
      },
      {
        id: 3,
        letter: 'G03',
        title: 'Препараты для лечения заболеваний мочеполовой системы',
      },
      {
        id: 4,
        letter: 'G04',
        title:
          'Препараты для лечения простатита и аденомы предстательной железы',
      },

      {
        id: 5,
        letter: 'G05',
        title: 'Препараты для лечения нарушений гормональной системы у женщин',
      },
      {
        id: 6,
        letter: 'G06',
        title: 'Препараты для лечения нарушений гормональной системы у мужчин',
      },
      {
        id: 7,
        letter: 'G07',
        title: 'Противозачаточные препараты',
      },
      {
        id: 8,
        letter: 'G08',
        title: 'Препараты для лечения бесплодия',
      },
      {
        id: 9,
        letter: 'G09',
        title: 'Препараты для лечения заболеваний гинекологической области',
      },
      {
        id: 10,
        letter: 'G10',
        title: 'Препараты для лечения заболеваний молочных желез у женщин',
      },
      {
        id: 11,
        letter: 'G11',
        title:
          'Препараты для лечения заболеваний мужской репродуктивной системы',
      },
      {
        id: 12,
        letter: 'G12',
        title:
          'Препараты для лечения нарушений функций половой системы у мужчин',
      },
      {
        id: 13,
        letter: 'G13',
        title: 'Средства для контрацепции и планирования семьи',
      },
      {
        id: 14,
        letter: 'G14',
        title: 'Прочие гинекологические препараты',
      },
    ],
  },
  {
    id: 15,
    letter: 'V',
    title: 'Различные средства',

    group: [
      {
        id: 1,
        letter: 'G01',
        title: 'Препараты для лечения заболеваний полости рта и десен',
      },
      {
        id: 2,
        letter: 'G02',
        title: 'Препараты для лечения заболеваний молочных желез',
      },
      {
        id: 3,
        letter: 'G03',
        title: 'Препараты для лечения заболеваний мочеполовой системы',
      },
      {
        id: 4,
        letter: 'G04',
        title:
          'Препараты для лечения простатита и аденомы предстательной железы',
      },

      {
        id: 5,
        letter: 'G05',
        title: 'Препараты для лечения нарушений гормональной системы у женщин',
      },
      {
        id: 6,
        letter: 'G06',
        title: 'Препараты для лечения нарушений гормональной системы у мужчин',
      },
      {
        id: 7,
        letter: 'G07',
        title: 'Противозачаточные препараты',
      },
      {
        id: 8,
        letter: 'G08',
        title: 'Препараты для лечения бесплодия',
      },
      {
        id: 9,
        letter: 'G09',
        title: 'Препараты для лечения заболеваний гинекологической области',
      },
      {
        id: 10,
        letter: 'G10',
        title: 'Препараты для лечения заболеваний молочных желез у женщин',
      },
      {
        id: 11,
        letter: 'G11',
        title:
          'Препараты для лечения заболеваний мужской репродуктивной системы',
      },
      {
        id: 12,
        letter: 'G12',
        title:
          'Препараты для лечения нарушений функций половой системы у мужчин',
      },
      {
        id: 13,
        letter: 'G13',
        title: 'Средства для контрацепции и планирования семьи',
      },
      {
        id: 14,
        letter: 'G14',
        title: 'Прочие гинекологические препараты',
      },
    ],
  },
];

export default atx_classification;

// const a_classification = [
//   {
//     id: 1,
//     letter: 'A01',
//     title: 'Стоматологические препараты',
//   },
//   {
//     id: 2,
//     letter: 'A02',
//     title:
//       'Препараты для лечения заболеваний связанных с нарушением кислотности',
//   },
//   {
//     id: 3,
//     letter: 'A03',
//     title:
//       'Препараты для лечения нарушенной функции желудочно-кишечного тракта',
//   },
//   {
//     id: 4,
//     letter: 'A04',
//     title: 'Противорвотные препараты',
//   },

//   {
//     id: 5,
//     letter: 'A06',
//     title: 'Препараты для лечения заболеваний печени и желчевыводящих путей',
//   },
//   {
//     id: 6,
//     letter: 'A07',
//     title: 'Слабительные средства',
//   },
//   {
//     id: 7,
//     letter: 'A09',
//     title: 'Противодиарейные препараты',
//   },
//   {
//     id: 8,
//     letter: 'A10',
//     title:
//       'Препараты для лечения избыточного веса (кроме диетических продуктов)',
//   },
//   {
//     id: 9,
//     letter: 'A11',
//     title: 'Препараты улучшающие пищеварение',
//   },
//   {
//     id: 10,
//     letter: 'A12',
//     title: 'Противопаразитарные препараты, инсектициды и репелленты',
//   },
//   {
//     id: 11,
//     letter: 'A13',
//     title: 'Минеральные добавки',
//   },
//   {
//     id: 12,
//     letter: 'A14',
//     title: 'Общетонизирующие препараты',
//   },
//   {
//     id: 13,
//     letter: 'A15',
//     title: 'Анаболические препараты',
//   },
//   {
//     id: 14,
//     letter: 'A16',
//     title: 'Средства повышающие аппетит',
//   },
//   {
//     id: 15,
//     letter: 'A17',
//     title:
//       'Прочие препараты для лечения заболеваний пищеварительной системы и обмена веществ',
//   },
// ];

// const b_classification = [
//   {
//     id: 1,
//     letter: 'B01',
//     title: 'Препарати для лікування захворювань шкіри',
//   },
//   {
//     id: 2,
//     letter: 'B02',
//     title: 'Препарати для лікування геморою та анальних тріщин',
//   },
//   {
//     id: 3,
//     letter: 'B03',
//     title: 'Препарати для лікування анемії',
//   },
//   {
//     id: 4,
//     letter: 'B05',
//     title: 'Розчинники та інфузійні розчини',
//   },
//   {
//     id: 5,
//     letter: 'B06',
//     title: 'Вітаміни та мікроелементи',
//   },
//   {
//     id: 6,
//     letter: 'B07',
//     title: 'Препарати для лікування ран та опіків',
//   },
//   {
//     id: 7,
//     letter: 'B08',
//     title: 'Антисептики та дезінфікуючі засоби',
//   },
//   {
//     id: 8,
//     letter: 'B09',
//     title: 'Імуномодулятори',
//   },
//   {
//     id: 9,
//     letter: 'B12',
//     title: 'Препарати з вітаміном В12',
//   },
//   {
//     id: 10,
//     letter: 'B13',
//     title: 'Інші вітаміни та мікроелементи',
//   },
// ];

// const c_classification = [
//   {
//     id: 1,
//     letter: 'C01',
//     title: 'Кардиотоніки',
//   },
//   {
//     id: 2,
//     letter: 'C02',
//     title: 'Антигіпертензивні засоби',
//   },
//   {
//     id: 3,
//     letter: 'C03',
//     title: 'Діуретики',
//   },
//   {
//     id: 4,
//     letter: 'C04',
//     title: 'Периферичні вазодилататори',
//   },
//   {
//     id: 5,
//     letter: 'C05',
//     title: 'Вазопротектори',
//   },
//   {
//     id: 6,
//     letter: 'C06',
//     title: 'Препарати для лікування варикозної хвороби',
//   },
//   {
//     id: 7,
//     letter: 'C07',
//     title: 'Бета-адреноблокатори',
//   },
//   {
//     id: 8,
//     letter: 'C08',
//     title: 'Кальцій-антагоністи',
//   },
//   {
//     id: 9,
//     letter: 'C09',
//     title: 'Інгібітори АПФ',
//   },
//   {
//     id: 10,
//     letter: 'C10',
//     title: 'Ліпідознижувальні засоби',
//   },
//   {
//     id: 11,
//     letter: 'C11',
//     title: 'Засоби для лікування гіпертригліцеридемії',
//   },
//   {
//     id: 12,
//     letter: 'C12',
//     title: 'Препарати для лікування гіпохолестеринемії',
//   },
//   {
//     id: 13,
//     letter: 'C13',
//     title: 'Препарати для лікування серцевої недостатності',
//   },
//   {
//     id: 14,
//     letter: 'C14',
//     title: 'Секретолітики травного тракту',
//   },
//   {
//     id: 15,
//     letter: 'C15',
//     title: 'Серцеві глікозиди',
//   },
//   {
//     id: 16,
//     letter: 'C16',
//     title: 'Препарати для лікування гіперурикемії та гіперурікозурії',
//   },
//   {
//     id: 17,
//     letter: 'C17',
//     title: 'Стероїдні гормони для системного застосування',
//   },
//   {
//     id: 18,
//     letter: 'C18',
//     title: 'Ліки для лікування ожиріння',
//   },
//   {
//     id: 19,
//     letter: 'C19',
//     title: 'Ліки для лікування злоякісних новоутворень',
//   },
//   {
//     id: 20,
//     letter: 'C20',
//     title: 'Ліки для лікування раку',
//   },
//   {
//     id: 21,
//     letter: 'C21',
//     title: 'Ліки для лікування раку шлунка',
//   },
//   {
//     id: 22,
//     letter: 'C22',
//     title: 'Ліки для лікування раку кишечника',
//   },
//   {
//     id: 23,
//     letter: 'C23',

//     title: 'Ліки для лікування раку молочної залози',
//   },
//   {
//     id: 24,
//     letter: 'C24',
//     title: 'Ліки для лікування раку шийки матки',
//   },
//   {
//     id: 25,
//     letter: 'C25',
//     title: 'Ліки для лікування раку матки',
//   },
//   {
//     id: 26,
//     letter: 'C26',
//     title: 'Ліки для лікування раку кишківника',
//   },
//   {
//     id: 27,
//     letter: 'C27',
//     title: 'Ліки для лікування раку нирок',
//   },
//   {
//     id: 28,
//     letter: 'C28',
//     title: 'Ліки для лікування раку печінки',
//   },
//   {
//     id: 29,
//     letter: 'C29',
//     title: 'Ліки для лікування раку легень',
//   },
//   {
//     id: 30,
//     letter: 'C30',
//     title: 'Ліки для лікування раку кості',
//   },
//   {
//     id: 31,
//     letter: 'C31',
//     title: 'Ліки для лікування раку слизової оболонки рота',
//   },
//   {
//     id: 32,
//     letter: 'C32',
//     title: 'Ліки для лікування раку слизової оболонки горла',
//   },
//   {
//     id: 33,
//     letter: 'C33',
//     title: 'Ліки для лікування раку слизової оболонки носа',
//   },
//   {
//     id: 34,
//     letter: 'C34',
//     title: 'Ліки для лікування раку слизової оболонки шлунка',
//   },
//   {
//     id: 35,
//     letter: 'C35',
//     title: 'Ліки для лікування раку слизової оболонки кишечника',
//   },
//   {
//     id: 36,
//     letter: 'C36',
//     title: 'Ліки для лікування раку слизової оболонки кишківника',
//   },
//   {
//     id: 37,
//     letter: 'C37',

//     title: 'Ліки для лікування раку слизової оболонки шийки матки',
//   },
//   {
//     id: 38,
//     letter: 'C38',
//     title: 'Ліки для лікування раку слизової оболонки матки',
//   },
//   {
//     id: 39,
//     letter: 'C39',
//     title: 'Ліки для лікування раку слизової оболонки прямої кишки',
//   },
//   {
//     id: 40,
//     letter: 'C40',
//     title: 'Ліки для лікування раку слизової оболонки шийки матки',
//   },
// ];
// const d_classification = [
//   {
//     id: 1,
//     letter: 'D01',
//     title: 'Препараты для лечения заболеваний кожи',
//   },
//   {
//     id: 2,
//     letter: 'D02',
//     title: 'Препараты для лечения заболеваний кожи и подкожной клетчатки',
//   },
//   {
//     id: 3,
//     letter: 'D03',
//     title:
//       'Препараты для лечения заболеваний кожи и подкожной клетчатки при применении наружно',
//   },
//   {
//     id: 4,
//     letter: 'D04',
//     title: 'Препараты для лечения заболеваний кожи при применении внутри',
//   },
//   {
//     id: 5,
//     letter: 'D05',
//     title:
//       'Препараты для лечения заболеваний кожи при применении наружно и внутри',
//   },
//   {
//     id: 6,
//     letter: 'D06',
//     title:
//       'Препараты для лечения заболеваний кожи и подкожной клетчатки при применении наружно',
//   },
//   {
//     id: 7,
//     letter: 'D07',
//     title: 'Препараты для лечения заболеваний кожи при применении наружно',
//   },
//   {
//     id: 8,
//     letter: 'D08',
//     title: 'Препараты для лечения заболеваний кожи при применении наружно',
//   },
//   {
//     id: 9,
//     letter: 'D09',
//     title: 'Препараты для лечения заболеваний кожи при применении наружно',
//   },
//   {
//     id: 10,
//     letter: 'D10',
//     title: 'Препараты для лечения заболеваний кожи при применении наружно',
//   },
//   {
//     id: 11,
//     letter: 'D11',
//     title: 'Препараты для лечения заболеваний волос и кожи головы',
//   },
//   {
//     id: 12,
//     letter: 'D12',
//     title: 'Препараты для лечения заболеваний кожи при применении наружно',
//   },
//   {
//     id: 13,
//     letter: 'D13',
//     title: 'Препараты для лечения заболеваний ногтей',
//   },
//   {
//     id: 14,
//     letter: 'D14',
//     title: 'Препараты для лечения заболеваний кожи при применении наружно',
//   },
//   {
//     id: 15,
//     letter: 'D15',
//     title: 'Препараты для лечения заболеваний кожи при применении наружно',
//   },
// ];

// const g_classification = [
//   {
//     id: 1,
//     letter: 'G01',
//     title: 'Препараты для лечения заболеваний полости рта и десен',
//   },
//   {
//     id: 2,
//     letter: 'G02',
//     title: 'Препараты для лечения заболеваний молочных желез',
//   },
//   {
//     id: 3,
//     letter: 'G03',
//     title: 'Препараты для лечения заболеваний мочеполовой системы',
//   },
//   {
//     id: 4,
//     letter: 'G04',
//     title: 'Препараты для лечения простатита и аденомы предстательной железы',
//   },

//   {
//     id: 5,
//     letter: 'G05',
//     title: 'Препараты для лечения нарушений гормональной системы у женщин',
//   },
//   {
//     id: 6,
//     letter: 'G06',
//     title: 'Препараты для лечения нарушений гормональной системы у мужчин',
//   },
//   {
//     id: 7,
//     letter: 'G07',
//     title: 'Противозачаточные препараты',
//   },
//   {
//     id: 8,
//     letter: 'G08',
//     title: 'Препараты для лечения бесплодия',
//   },
//   {
//     id: 9,
//     letter: 'G09',
//     title: 'Препараты для лечения заболеваний гинекологической области',
//   },
//   {
//     id: 10,
//     letter: 'G10',
//     title: 'Препараты для лечения заболеваний молочных желез у женщин',
//   },
//   {
//     id: 11,
//     letter: 'G11',
//     title: 'Препараты для лечения заболеваний мужской репродуктивной системы',
//   },
//   {
//     id: 12,
//     letter: 'G12',
//     title: 'Препараты для лечения нарушений функций половой системы у мужчин',
//   },
//   {
//     id: 13,
//     letter: 'G13',
//     title: 'Средства для контрацепции и планирования семьи',
//   },
//   {
//     id: 14,
//     letter: 'G14',
//     title: 'Прочие гинекологические препараты',
//   },
// ];
