const newsData = [
  {
    id: 1,
    image: 'news-1.jpg',
    alt: 'news-1',
    category: 'Категория',
    text: 'ЕМА опубликовало рекомендации по составу вакцин против гриппа на 2021г.',
  },
  {
    id: 2,
    image: 'news-2.jpg',
    alt: 'news-2',
    category: 'Категория',
    text: 'Медицинские мифы: 6 заблуждений о мигрени',
  },
  {
    id: 3,
    image: 'news-3.jpg',
    alt: 'news-3',
    category: 'Категория',

    text: 'Эмпаглифлозин одобрен в ЕС при сердечной недостаточности',
  },
  {
    id: 4,
    image: 'news-4.jpg',
    alt: 'news-4',
    category: 'Категория',
    text: 'Музыка и регуляция эмоций: возможно ли клиническое применение?',
  },
  {
    id: 5,
    image: 'news-5.jpg',
    alt: 'news-5',
    category: 'Категория',
    text: 'ЕМА опубликовало рекомендации по составу вакцин против гриппа на 2021г.',
  },
  {
    id: 6,
    image: 'news-6.jpg',
    alt: 'news-6',
    category: 'Категория',
    text: 'Медицинские мифы: 6 заблуждений о мигрени',
  },
  {
    id: 7,

    image: 'news-7.jpg',
    alt: 'news-7',
    category: 'Категория',
    text: 'Эмпаглифлозин одобрен в ЕС при сердечной недостаточности',
  },
  {
    id: 8,
    image: 'news-8.jpg',
    alt: 'news-8',
    category: 'Категория',
    text: 'Музыка и регуляция эмоций: возможно ли клиническое применение?',
  },
  {
    id: 9,
    image: 'news-9.jpg',
    alt: 'news-9',
    category: 'Категория',
    text: 'ЕМА опубликовало рекомендации по составу вакцин против гриппа на 2021г.',
  },
  {
    id: 10,
    image: 'news-10.jpg',
    alt: 'news-10',
    category: 'Категория',
    text: 'Медицинские мифы: 6 заблуждений о мигрени',
  },
];

export default newsData;
