const news_data = [
  {
    image: 'news-1.jpg',
    alt: 'рекомендації щодо складу вакцин проти грипу',
    category: 'Категорія',

    text: 'ЕМА опублікувало рекомендації щодо складу вакцин проти грипу на 2021р.',
  },
  {
    image: 'news-2.jpg',
    alt: 'Медичні міфи: 6 помилок про мігреню',
    category: 'Категорія',
    text: 'Медичні міфи: 6 помилок про мігреню',
  },
  {
    image: 'news-3.jpg',
    alt: 'Емпагліфлозин схвалений в ЄС при серцевій недостатності',
    category: 'Категорія',
    text: 'Емпагліфлозин схвалений в ЄС при серцевій недостатності',
  },
];

export default news_data;
